---
kind: property
id: P:Autodesk.Revit.DB.Events.FamilyLoadedIntoDocumentEventArgs.OriginalFamilyId
source: html/2ec3e15e-4496-4c6c-4fb5-3d056cd28680.htm
---
# Autodesk.Revit.DB.Events.FamilyLoadedIntoDocumentEventArgs.OriginalFamilyId Property

The original family id that is overridden by the newly loaded family.

## Syntax (C#)
```csharp
public ElementId OriginalFamilyId { get; }
```